; domain
; source: https://github.com/AI-Planning/pddl-generators/blob/main/ferry/domain.pddl
; updates: typing car and locations; sail precs have now (not (at-ferry ?to)) so (not-eq ?from ?to) can be removed
(define (domain ferry)
   (:requirements :typing :strips :negative-preconditions)
   (:types car - object 
           location - object)

   (:predicates
		(at-ferry ?l - location)
		(at ?c - car ?l - location)
		(empty-ferry)
		(on ?c - car))

   (:action sail
       :parameters  (?from - location ?to - location)
       :precondition (and (at-ferry ?from) (not (at-ferry ?to)))
       :effect (and  (at-ferry ?to) (not (at-ferry ?from))))

   (:action board
       :parameters (?car - car ?loc - location)
       :precondition (and (at ?car ?loc) (at-ferry ?loc) (empty-ferry))
       :effect (and
            (on ?car)
		    (not (at ?car ?loc)) 
		    (not (empty-ferry))))

   (:action debark
       :parameters (?car - car  ?loc - location)
       :precondition (and (on ?car) (at-ferry ?loc))
       :effect (and
            (at ?car ?loc)
		    (empty-ferry)
		    (not (on ?car)))))

; problem
(define (problem ferry-56)
 (:domain ferry)
 (:objects 
    car1 car2 car3 car4 car5 car6 car7 car8 car9 car10 car11 - car
    loc1 loc2 loc3 loc4 loc5 loc6 loc7 loc8 loc9 loc10 - location
 )
 (:init 
    (empty-ferry)
    (at-ferry loc1)
    (at car1 loc9)
    (at car2 loc6)
    (at car3 loc1)
    (at car4 loc2)
    (at car5 loc9)
    (at car6 loc5)
    (at car7 loc7)
    (at car8 loc2)
    (at car9 loc9)
    (at car10 loc2)
    (at car11 loc7)
)
 (:goal (and 
(at car9 loc5)
))
)

; plan
1. (sail loc1 loc9)
   deleted: (at-ferry loc1)
   added: (at-ferry loc9)
   goals met: 0 of 1
2. (board car9 loc9)
   deleted: (at car9 loc9) (empty-ferry)
   added: (on car9)
   goals met: 0 of 1
3. (sail loc9 loc5)
   deleted: (at-ferry loc9)
   added: (at-ferry loc5)
   goals met: 0 of 1
4. (debark car9 loc5)
   deleted: (on car9)
   added: (at car9 loc5) (empty-ferry)
   goals met: 1 of 1
